# Напишіть програму, яка визначає поведінку космічного апарата, 
# що стартує на екваторі, залежно від його початкової швидкості v, 
# заданої у км/с (дійсні числа). Як ви знаєте з уроків фізики, 
# тут можливі чотири випадки: при v < 7,8 км/с апарат впаде на поверхню Землі; 
# при 7,8 ≤ v < 11,2 км/с апарат стане супутником Землі; 
# при 11,2 ≤ v < 16,4 км/с апарат стане супутником Сонця; 
# при v ≥ 16,4 км/с космічний апарат покине Сонячну систему.

v = float(input("Введіть число: "))

if v < 7.8:
    print("апарат впаде на поверхню Землі")
elif v >= 7.8 and v < 11.2:
    print("апарат стане супутником Землі")
elif 11.2 <= v < 16.4:
    print("апарат стане супутником Сонця")
else:
    print("апарат покине Сонячну систему") 
